In [1]:
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('seaborn')
import pandas as pd
import pydst
dst = pydst.Dst(lang='en')

#In this dataproject we will look analyse the employment rate in the danish 

In our dataproject we look at GDP per capita and population in the major regions of the world in the period 1970-2015. We look at the growth rates that the regions have experinced in the period, and do our best to explain why we see the patterns that exist. We start out showing the development of GDP per capita and population in levels, then move on to show the relative development and finally we show 5-year growth rates.

dst.get_subjects()
dst.get_tables(subjects=['14']).sample(10)
dst.get_data(table_id = 'RAS200').head(10)

indk_vars = dst.get_variables(table_id='RAS200')
indk_vars

indk_vars['values'][0][:10]

inc_api = dst.get_data(table_id = 'RAS200', variables={'OMRÅDE':['*'], 'BEREGNING':['*'], 'TID':['*']})
inc_api

del inc_api['ALDER']

inc_api

del inc_api['HERKOMST']

del inc_api['KØN']

inc_api.rename(columns = {'OMRÅDE':'municipality'}, inplace=True)
inc_api


myDict = {}
for i in range(2005, 2019): # range goes from 2008 to but not including 2017
    myDict[str(i)] = f'e{i}' 
myDict

inc_api.rename(columns = myDict, inplace=True)
inc_api.head(10)

I  = inc_api.municipality.str.contains('Region')
inc_api.loc[I, :]
for val in ['Region', 'Province', 'All Denmark']: 
    I = inc_api.municipality.str.contains(val)
    inc_api = inc_api.loc[I == False] # keep everything else
    
inc_api.rename(columns = {'TID':'year'}, inplace=True)
inc_api 

I  = inc_api.BEREGNING.str.contains('Region')

for val in ['Economic activity rate']: 
    I = inc_api.BEREGNING.str.contains(val)
    inc_api = inc_api.loc[I == False] # keep everything else

del inc_api['BEREGNING']    
    
inc_api

       municipality  year  INDHOLD
0              Køge  2011     73.7
1              Køge  2012     73.3
2              Køge  2013     73.1
3              Køge  2014     74.1
4           Rødovre  2011     73.6
...             ...   ...      ...
2542         Viborg  2018     76.0
2544        Randers  2018     73.9
2546    Brønderslev  2018     74.8
2548      Silkeborg  2018     77.8
2550  Frederikshavn  2018     73.1

[1089 rows x 3 columns]

In [2]:
inc_api.pivot(index='municipality', columns='year', values='INDHOLD')
inc_api.head(10)
#inc_api.pivot skulle gerne bytte om, så year kommer øverst. Dette virker i jupyter lab - kan ikke se hvorfor det ikke virker her.

  municipality  year  INDHOLD
0         Køge  2011     73.7
1         Køge  2012     73.3
2         Køge  2013     73.1
3         Køge  2014     74.1
4      Rødovre  2011     73.6
5      Rødovre  2012     73.0
6      Rødovre  2013     73.2
7      Rødovre  2014     73.5
8       Dragør  2011     78.5
9       Dragør  2012     78.7

In [3]:
inc_api_1 = inc_api.sort_values(['municipality','year']) # sort by first municipality then year
inc_api_1

     municipality  year  INDHOLD
1351     Aabenraa  2008     74.6
1352     Aabenraa  2009     71.6
1353     Aabenraa  2010     70.9
570      Aabenraa  2011     70.2
571      Aabenraa  2012     69.5
...           ...   ...      ...
222           Ærø  2014     65.1
1811          Ærø  2015     65.8
1894          Ærø  2016     67.0
2294          Ærø  2017     68.1
2408          Ærø  2018     70.1

[1089 rows x 3 columns]

In [4]:
inc_api_1.rename(columns = {'INDHOLD':'Employment rate'}, inplace=True)
inc_api_1

     municipality  year  Employment rate
1351     Aabenraa  2008             74.6
1352     Aabenraa  2009             71.6
1353     Aabenraa  2010             70.9
570      Aabenraa  2011             70.2
571      Aabenraa  2012             69.5
...           ...   ...              ...
222           Ærø  2014             65.1
1811          Ærø  2015             65.8
1894          Ærø  2016             67.0
2294          Ærø  2017             68.1
2408          Ærø  2018             70.1

[1089 rows x 3 columns]

In [5]:

dst.get_subjects()
dst.get_tables(subjects=['14']).sample(10)
dst.get_data(table_id = 'UHELDK7').head(10)

uheld_vars = dst.get_variables(table_id='UHELDK7')
uheld_vars

,id,text,elimination,time,values,map
0,UHELDA,type of accident,True,False,"[{'id': '0000', 'text': 'All accidents'}, {'id...",NaN
1,OMRÅDE,region,True,False,"[{'id': '000', 'text': 'All Denmark'}, {'id': ...",denmark_municipality_07
2,BYLAND,urban area,True,False,"[{'id': '001', 'text': 'Inside urban area'}, {...",NaN
3,UHELDSIT,accident situation,True,False,"[{'id': '000', 'text': 'One-vehicle accidents'...",NaN
4,Tid,time,False,True,"[{'id': '1998', 'text': '1998'}, {'id': '1999'...",NaN

In [6]:
uheld_vars['values'][0][:10]

[{'id': '0000', 'text': 'All accidents'},
 {'id': '1000', 'text': 'Accidents involving persons influenced by alcohol'},
 {'id': '2000', 'text': 'Others accidents'}]

In [7]:
uheld_1 = dst.get_data(table_id = 'UHELDK7', variables={'OMRÅDE':['*'], 'UHELDA':['*'], 'TID':['*']})
uheld_1

,OMRÅDE,UHELDA,TID,BYLAND,UHELDSIT,INDHOLD
0,All Denmark,All accidents,2013,Inside urban area,One-vehicle accidents,205
1,Region Nordjylland,All accidents,2013,Inside urban area,One-vehicle accidents,30
2,Region Midtjylland,All accidents,2013,Inside urban area,One-vehicle accidents,46
3,Region Syddanmark,All accidents,2013,Inside urban area,One-vehicle accidents,56
4,Region Hovedstaden,All accidents,2013,Inside urban area,One-vehicle accidents,46
...,...,...,...,...,...,...
4785,Vesthimmerlands,Others accidents,2018,Inside urban area,One-vehicle accidents,1
4786,Mariagerfjord,Others accidents,2018,Inside urban area,One-vehicle accidents,1
4787,Jammerbugt,Others accidents,2018,Inside urban area,One-vehicle accidents,2
4788,Aalborg,Others accidents,2018,Inside urban area,One-vehicle accidents,6
4789,Hjørring,Others accidents,2018,Inside urban area,One-vehicle accidents,5

In [8]:
del uheld_1['BYLAND']

del uheld_1['UHELDSIT']

uheld_1.rename(columns = {'OMRÅDE':'municipality', 'TID': 'year'}, inplace=True)
uheld_1

            municipality            UHELDA  year  INDHOLD
0            All Denmark     All accidents  2013      205
1     Region Nordjylland     All accidents  2013       30
2     Region Midtjylland     All accidents  2013       46
3      Region Syddanmark     All accidents  2013       56
4     Region Hovedstaden     All accidents  2013       46
...                  ...               ...   ...      ...
4785     Vesthimmerlands  Others accidents  2018        1
4786       Mariagerfjord  Others accidents  2018        1
4787          Jammerbugt  Others accidents  2018        2
4788             Aalborg  Others accidents  2018        6
4789            Hjørring  Others accidents  2018        5

[4790 rows x 4 columns]

In [9]:
I  = uheld_1.municipality.str.contains('Region')
uheld_1.loc[I, :]
for val in ['Region', 'Province', 'All Denmark']: 
    I = uheld_1.municipality.str.contains(val)
    uheld_1 = uheld_1.loc[I == False] # keep everything else

uheld_1

         municipality            UHELDA  year  INDHOLD
6          Copenhagen     All accidents  2013       17
7            Ballerup     All accidents  2013        2
8             Brøndby     All accidents  2013        1
9              Dragør     All accidents  2013        1
10           Glostrup     All accidents  2013        1
...               ...               ...   ...      ...
4785  Vesthimmerlands  Others accidents  2018        1
4786    Mariagerfjord  Others accidents  2018        1
4787       Jammerbugt  Others accidents  2018        2
4788          Aalborg  Others accidents  2018        6
4789         Hjørring  Others accidents  2018        5

[4412 rows x 4 columns]

In [10]:
I  = uheld_1.UHELDA.str.contains('All accidents')
for val in ['Other', 'involving']: 
    I = uheld_1.UHELDA.str.contains(val)
    uheld_1 = uheld_1.loc[I == False] # keep everything else

uheld_1

         municipality         UHELDA  year  INDHOLD
6          Copenhagen  All accidents  2013       17
7            Ballerup  All accidents  2013        2
8             Brøndby  All accidents  2013        1
9              Dragør  All accidents  2013        1
10           Glostrup  All accidents  2013        1
...               ...            ...   ...      ...
4684  Vesthimmerlands  All accidents  2018        1
4685    Mariagerfjord  All accidents  2018        2
4686       Jammerbugt  All accidents  2018        2
4687          Aalborg  All accidents  2018       13
4688         Hjørring  All accidents  2018        6

[1692 rows x 4 columns]

In [11]:
uheld_2 = uheld_1.sort_values(['municipality','year']) # sort by first municipality then year
uheld_2

     municipality         UHELDA  year  INDHOLD
2704     Aabenraa  All accidents  1998        9
2454     Aabenraa  All accidents  1999        8
2120     Aabenraa  All accidents  2000        9
1780     Aabenraa  All accidents  2001        7
1704     Aabenraa  All accidents  2002        7
...           ...            ...   ...      ...
3197          Ærø  All accidents  2009        2
3515          Ærø  All accidents  2011        2
4101          Ærø  All accidents  2015        2
4338          Ærø  All accidents  2016        2
4601          Ærø  All accidents  2017        1

[1692 rows x 4 columns]

In [12]:
uheld_2.rename(columns = {'INDHOLD':'Number of accidents'}, inplace=True)
uheld_2

     municipality         UHELDA  year  Number of accidents
2704     Aabenraa  All accidents  1998                    9
2454     Aabenraa  All accidents  1999                    8
2120     Aabenraa  All accidents  2000                    9
1780     Aabenraa  All accidents  2001                    7
1704     Aabenraa  All accidents  2002                    7
...           ...            ...   ...                  ...
3197          Ærø  All accidents  2009                    2
3515          Ærø  All accidents  2011                    2
4101          Ærø  All accidents  2015                    2
4338          Ærø  All accidents  2016                    2
4601          Ærø  All accidents  2017                    1

[1692 rows x 4 columns]

In [13]:
del uheld_2['UHELDA']

uheld_2

     municipality  year  Number of accidents
2704     Aabenraa  1998                    9
2454     Aabenraa  1999                    8
2120     Aabenraa  2000                    9
1780     Aabenraa  2001                    7
1704     Aabenraa  2002                    7
...           ...   ...                  ...
3197          Ærø  2009                    2
3515          Ærø  2011                    2
4101          Ærø  2015                    2
4338          Ærø  2016                    2
4601          Ærø  2017                    1

[1692 rows x 3 columns]